## Plan Result (dev_frontdoor)




<pre><code>Plan: 10 to add, 2 to change, 0 to destroy.</code></pre>

* Create
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;dev-trib-admin-appeals&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;dev-trib-care-standards&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;dev-trib-cicap&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;dev-trib-employment-appeals&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;dev-trib-finance-tax&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;dev-trib-immigration-svcs&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;dev-trib-info-rights&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;dev-trib-land-reg-division&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;dev-trib-lands-chamber&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;dev-trib-tansport-appeals&#34;]
* Update
  * module.landing_zone[0].azurerm_frontdoor.main
  * module.landing_zone[0].azurerm_monitor_diagnostic_setting.diagnostics_access_logs_sa[0]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.landing_zone[0].azurerm_frontdoor.main will be updated in-place
  # (moved from module.landing_zone.azurerm_frontdoor.main)
  ~ resource "azurerm_frontdoor" "main" {
        id                                   = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoors/sdshmcts-dev"
        name                                 = "sdshmcts-dev"
        tags                                 = {
            "application"  = "core"
            "builtFrom"    = "hmcts/sds-azure-platform"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "Low"
            "environment"  = "development"
        }
        # (11 unchanged attributes hidden)

      ~ routing_rule {
          ~ accepted_protocols = [
              - "Http",
              + "Https",
            ]
            id                 = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoors/sdshmcts-dev/routingRules/dev-trib-land-reg-division"
            name               = "dev-trib-land-reg-division"
            # (3 unchanged attributes hidden)

          ~ forwarding_configuration {
              ~ forwarding_protocol                   = "HttpsOnly" -> "HttpOnly"
                # (5 unchanged attributes hidden)
            }
        }
      ~ routing_rule {
          ~ accepted_protocols = [
              - "Http",
              + "Https",
            ]
            id                 = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoors/sdshmcts-dev/routingRules/dev-trib-immigration-svcs"
            name               = "dev-trib-immigration-svcs"
            # (3 unchanged attributes hidden)

          ~ forwarding_configuration {
              ~ forwarding_protocol                   = "HttpsOnly" -> "HttpOnly"
                # (5 unchanged attributes hidden)
            }
        }
      ~ routing_rule {
          ~ accepted_protocols = [
              - "Http",
              + "Https",
            ]
            id                 = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoors/sdshmcts-dev/routingRules/dev-trib-info-rights"
            name               = "dev-trib-info-rights"
            # (3 unchanged attributes hidden)

          ~ forwarding_configuration {
              ~ forwarding_protocol                   = "HttpsOnly" -> "HttpOnly"
                # (5 unchanged attributes hidden)
            }
        }
      ~ routing_rule {
          ~ accepted_protocols = [
              - "Http",
              + "Https",
            ]
            id                 = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoors/sdshmcts-dev/routingRules/dev-trib-admin-appeals"
            name               = "dev-trib-admin-appeals"
            # (3 unchanged attributes hidden)

          ~ forwarding_configuration {
              ~ forwarding_protocol                   = "HttpsOnly" -> "HttpOnly"
                # (5 unchanged attributes hidden)
            }
        }
      ~ routing_rule {
          ~ accepted_protocols = [
              - "Http",
              + "Https",
            ]
            id                 = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoors/sdshmcts-dev/routingRules/dev-trib-care-standards"
            name               = "dev-trib-care-standards"
            # (3 unchanged attributes hidden)

          ~ forwarding_configuration {
              ~ forwarding_protocol                   = "HttpsOnly" -> "HttpOnly"
                # (5 unchanged attributes hidden)
            }
        }
      ~ routing_rule {
          ~ accepted_protocols = [
              - "Http",
              + "Https",
            ]
            id                 = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoors/sdshmcts-dev/routingRules/dev-trib-lands-chamber"
            name               = "dev-trib-lands-chamber"
            # (3 unchanged attributes hidden)

          ~ forwarding_configuration {
              ~ forwarding_protocol                   = "HttpsOnly" -> "HttpOnly"
                # (5 unchanged attributes hidden)
            }
        }
      ~ routing_rule {
          ~ accepted_protocols = [
              - "Http",
              + "Https",
            ]
            id                 = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoors/sdshmcts-dev/routingRules/dev-trib-finance-tax"
            name               = "dev-trib-finance-tax"
            # (3 unchanged attributes hidden)

          ~ forwarding_configuration {
              ~ forwarding_protocol                   = "HttpsOnly" -> "HttpOnly"
                # (5 unchanged attributes hidden)
            }
        }
      ~ routing_rule {
          ~ accepted_protocols = [
              - "Http",
              + "Https",
            ]
            id                 = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoors/sdshmcts-dev/routingRules/dev-trib-employment-appeals"
            name               = "dev-trib-employment-appeals"
            # (3 unchanged attributes hidden)

          ~ forwarding_configuration {
              ~ forwarding_protocol                   = "HttpsOnly" -> "HttpOnly"
                # (5 unchanged attributes hidden)
            }
        }
      ~ routing_rule {
          ~ accepted_protocols = [
              - "Http",
              + "Https",
            ]
            id                 = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoors/sdshmcts-dev/routingRules/dev-trib-tansport-appeals"
            name               = "dev-trib-tansport-appeals"
            # (3 unchanged attributes hidden)

          ~ forwarding_configuration {
              ~ forwarding_protocol                   = "HttpsOnly" -> "HttpOnly"
                # (5 unchanged attributes hidden)
            }
        }
      ~ routing_rule {
          ~ accepted_protocols = [
              - "Http",
              + "Https",
            ]
            id                 = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoors/sdshmcts-dev/routingRules/dev-trib-cicap"
            name               = "dev-trib-cicap"
            # (3 unchanged attributes hidden)

          ~ forwarding_configuration {
              ~ forwarding_protocol                   = "HttpsOnly" -> "HttpOnly"
                # (5 unchanged attributes hidden)
            }
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "pre-portal",
              + "dev-trib-land-reg-division",
            ]
            id                 = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoors/sdshmcts-dev/routingRules/pre-portalHttpsRedirect"
          ~ name               = "pre-portalHttpsRedirect" -> "dev-trib-land-reg-divisionHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "darts-portal",
              + "dev-trib-immigration-svcs",
            ]
            id                 = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoors/sdshmcts-dev/routingRules/darts-portalHttpsRedirect"
          ~ name               = "darts-portalHttpsRedirect" -> "dev-trib-immigration-svcsHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ accepted_protocols = [
              - "Https",
              + "Http",
            ]
          ~ frontend_endpoints = [
              - "dev-trib-land-reg-division",
              + "dev-trib-info-rights",
            ]
            id                 = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoors/sdshmcts-dev/routingRules/dev-trib-land-reg-divisionhttp"
          ~ name               = "dev-trib-land-reg-divisionhttp" -> "dev-trib-info-rightsHttpsRedirect"
            # (2 unchanged attributes hidden)

          - forwarding_configuration {
              - backend_pool_name                     = "dev-trib-land-reg-division" -> null
              - cache_enabled                         = true -> null
              - cache_query_parameter_strip_directive = "StripNone" -> null
              - cache_query_parameters                = [] -> null
              - cache_use_dynamic_compression         = true -> null
              - forwarding_protocol                   = "HttpOnly" -> null
            }

          + redirect_configuration {
              + redirect_protocol = "HttpsOnly"
              + redirect_type     = "Moved"
            }
        }
      + routing_rule {
          + accepted_protocols = [
              + "Http",
            ]
          + enabled            = true
          + frontend_endpoints = [
              + "dev-trib-admin-appeals",
            ]
          + name               = "dev-trib-admin-appealsHttpsRedirect"
          + patterns_to_match  = [
              + "/*",
            ]

          + redirect_configuration {
              + redirect_protocol = "HttpsOnly"
              + redirect_type     = "Moved"
            }
        }
      + routing_rule {
          + accepted_protocols = [
              + "Http",
            ]
          + enabled            = true
          + frontend_endpoints = [
              + "dev-trib-care-standards",
            ]
          + name               = "dev-trib-care-standardsHttpsRedirect"
          + patterns_to_match  = [
              + "/*",
            ]

          + redirect_configuration {
              + redirect_protocol = "HttpsOnly"
              + redirect_type     = "Moved"
            }
        }
      + routing_rule {
          + accepted_protocols = [
              + "Http",
            ]
          + enabled            = true
          + frontend_endpoints = [
              + "dev-trib-lands-chamber",
            ]
          + name               = "dev-trib-lands-chamberHttpsRedirect"
          + patterns_to_match  = [
              + "/*",
            ]

          + redirect_configuration {
              + redirect_protocol = "HttpsOnly"
              + redirect_type     = "Moved"
            }
        }
      + routing_rule {
          + accepted_protocols = [
              + "Http",
            ]
          + enabled            = true
          + frontend_endpoints = [
              + "dev-trib-finance-tax",
            ]
          + name               = "dev-trib-finance-taxHttpsRedirect"
          + patterns_to_match  = [
              + "/*",
            ]

          + redirect_configuration {
              + redirect_protocol = "HttpsOnly"
              + redirect_type     = "Moved"
            }
        }
      + routing_rule {
          + accepted_protocols = [
              + "Http",
            ]
          + enabled            = true
          + frontend_endpoints = [
              + "dev-trib-employment-appeals",
            ]
          + name               = "dev-trib-employment-appealsHttpsRedirect"
          + patterns_to_match  = [
              + "/*",
            ]

          + redirect_configuration {
              + redirect_protocol = "HttpsOnly"
              + redirect_type     = "Moved"
            }
        }
      + routing_rule {
          + accepted_protocols = [
              + "Http",
            ]
          + enabled            = true
          + frontend_endpoints = [
              + "dev-trib-tansport-appeals",
            ]
          + name               = "dev-trib-tansport-appealsHttpsRedirect"
          + patterns_to_match  = [
              + "/*",
            ]

          + redirect_configuration {
              + redirect_protocol = "HttpsOnly"
              + redirect_type     = "Moved"
            }
        }
      + routing_rule {
          + accepted_protocols = [
              + "Http",
            ]
          + enabled            = true
          + frontend_endpoints = [
              + "pre-portal",
            ]
          + name               = "pre-portalHttpsRedirect"
          + patterns_to_match  = [
              + "/*",
            ]

          + redirect_configuration {
              + redirect_protocol = "HttpsOnly"
              + redirect_type     = "Moved"
            }
        }
      + routing_rule {
          + accepted_protocols = [
              + "Http",
            ]
          + enabled            = true
          + frontend_endpoints = [
              + "dev-trib-cicap",
            ]
          + name               = "dev-trib-cicapHttpsRedirect"
          + patterns_to_match  = [
              + "/*",
            ]

          + redirect_configuration {
              + redirect_protocol = "HttpsOnly"
              + redirect_type     = "Moved"
            }
        }
      + routing_rule {
          + accepted_protocols = [
              + "Http",
            ]
          + enabled            = true
          + frontend_endpoints = [
              + "darts-portal",
            ]
          + name               = "darts-portalHttpsRedirect"
          + patterns_to_match  = [
              + "/*",
            ]

          + redirect_configuration {
              + redirect_protocol = "HttpsOnly"
              + redirect_type     = "Moved"
            }
        }

        # (140 unchanged blocks hidden)
    }

  # module.landing_zone.azurerm_frontdoor_custom_https_configuration.https["darts-portal"] has moved to module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https["darts-portal"]
    resource "azurerm_frontdoor_custom_https_configuration" "https" {
        id                                = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoors/sdshmcts-dev/customHttpsConfiguration/darts-portal"
        # (2 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.landing_zone.azurerm_frontdoor_custom_https_configuration.https["dev-casetracker"] has moved to module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https["dev-casetracker"]
    resource "azurerm_frontdoor_custom_https_configuration" "https" {
        id                                = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoors/sdshmcts-dev/customHttpsConfiguration/dev-casetracker"
        # (2 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.landing_zone.azurerm_frontdoor_custom_https_configuration.https["dev-certificatedbailiffs"] has moved to module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https["dev-certificatedbailiffs"]
    resource "azurerm_frontdoor_custom_https_configuration" "https" {
        id                                = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoors/sdshmcts-dev/customHttpsConfiguration/dev-certificatedbailiffs"
        # (2 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.landing_zone.azurerm_frontdoor_custom_https_configuration.https["dev-courtfines"] has moved to module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https["dev-courtfines"]
    resource "azurerm_frontdoor_custom_https_configuration" "https" {
        id                                = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoors/sdshmcts-dev/customHttpsConfiguration/dev-courtfines"
        # (2 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.landing_zone.azurerm_frontdoor_custom_https_configuration.https["dev-immigrationappealsonline"] has moved to module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https["dev-immigrationappealsonline"]
    resource "azurerm_frontdoor_custom_https_configuration" "https" {
        id                                = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoors/sdshmcts-dev/customHttpsConfiguration/dev-immigrationappealsonline"
        # (2 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https["dev-trib-admin-appeals"] will be created
  + resource "azurerm_frontdoor_custom_https_configuration" "https" {
      + custom_https_provisioning_enabled = true
      + frontend_endpoint_id              = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoors/sdshmcts-dev/frontendEndpoints/dev-trib-admin-appeals"
      + id                                = (known after apply)

      + custom_https_configuration {
          + certificate_source    = "FrontDoor"
          + minimum_tls_version   = (known after apply)
          + provisioning_state    = (known after apply)
          + provisioning_substate = (known after apply)
        }
    }

  # module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https["dev-trib-care-standards"] will be created
  + resource "azurerm_frontdoor_custom_https_configuration" "https" {
      + custom_https_provisioning_enabled = true
      + frontend_endpoint_id              = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoors/sdshmcts-dev/frontendEndpoints/dev-trib-care-standards"
      + id                                = (known after apply)

      + custom_https_configuration {
          + certificate_source    = "FrontDoor"
          + minimum_tls_version   = (known after apply)
          + provisioning_state    = (known after apply)
          + provisioning_substate = (known after apply)
        }
    }

  # module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https["dev-trib-cicap"] will be created
  + resource "azurerm_frontdoor_custom_https_configuration" "https" {
      + custom_https_provisioning_enabled = true
      + frontend_endpoint_id              = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoors/sdshmcts-dev/frontendEndpoints/dev-trib-cicap"
      + id                                = (known after apply)

      + custom_https_configuration {
          + certificate_source    = "FrontDoor"
          + minimum_tls_version   = (known after apply)
          + provisioning_state    = (known after apply)
          + provisioning_substate = (known after apply)
        }
    }

  # module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https["dev-trib-employment-appeals"] will be created
  + resource "azurerm_frontdoor_custom_https_configuration" "https" {
      + custom_https_provisioning_enabled = true
      + frontend_endpoint_id              = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoors/sdshmcts-dev/frontendEndpoints/dev-trib-employment-appeals"
      + id                                = (known after apply)

      + custom_https_configuration {
          + certificate_source    = "FrontDoor"
          + minimum_tls_version   = (known after apply)
          + provisioning_state    = (known after apply)
          + provisioning_substate = (known after apply)
        }
    }

  # module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https["dev-trib-finance-tax"] will be created
  + resource "azurerm_frontdoor_custom_https_configuration" "https" {
      + custom_https_provisioning_enabled = true
      + frontend_endpoint_id              = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoors/sdshmcts-dev/frontendEndpoints/dev-trib-finance-tax"
      + id                                = (known after apply)

      + custom_https_configuration {
          + certificate_source    = "FrontDoor"
          + minimum_tls_version   = (known after apply)
          + provisioning_state    = (known after apply)
          + provisioning_substate = (known after apply)
        }
    }

  # module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https["dev-trib-immigration-svcs"] will be created
  + resource "azurerm_frontdoor_custom_https_configuration" "https" {
      + custom_https_provisioning_enabled = true
      + frontend_endpoint_id              = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoors/sdshmcts-dev/frontendEndpoints/dev-trib-immigration-svcs"
      + id                                = (known after apply)

      + custom_https_configuration {
          + certificate_source    = "FrontDoor"
          + minimum_tls_version   = (known after apply)
          + provisioning_state    = (known after apply)
          + provisioning_substate = (known after apply)
        }
    }

  # module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https["dev-trib-info-rights"] will be created
  + resource "azurerm_frontdoor_custom_https_configuration" "https" {
      + custom_https_provisioning_enabled = true
      + frontend_endpoint_id              = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoors/sdshmcts-dev/frontendEndpoints/dev-trib-info-rights"
      + id                                = (known after apply)

      + custom_https_configuration {
          + certificate_source    = "FrontDoor"
          + minimum_tls_version   = (known after apply)
          + provisioning_state    = (known after apply)
          + provisioning_substate = (known after apply)
        }
    }

  # module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https["dev-trib-land-reg-division"] will be created
  + resource "azurerm_frontdoor_custom_https_configuration" "https" {
      + custom_https_provisioning_enabled = true
      + frontend_endpoint_id              = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoors/sdshmcts-dev/frontendEndpoints/dev-trib-land-reg-division"
      + id                                = (known after apply)

      + custom_https_configuration {
          + certificate_source    = "FrontDoor"
          + minimum_tls_version   = (known after apply)
          + provisioning_state    = (known after apply)
          + provisioning_substate = (known after apply)
        }
    }

  # module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https["dev-trib-lands-chamber"] will be created
  + resource "azurerm_frontdoor_custom_https_configuration" "https" {
      + custom_https_provisioning_enabled = true
      + frontend_endpoint_id              = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoors/sdshmcts-dev/frontendEndpoints/dev-trib-lands-chamber"
      + id                                = (known after apply)

      + custom_https_configuration {
          + certificate_source    = "FrontDoor"
          + minimum_tls_version   = (known after apply)
          + provisioning_state    = (known after apply)
          + provisioning_substate = (known after apply)
        }
    }

  # module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https["dev-trib-tansport-appeals"] will be created
  + resource "azurerm_frontdoor_custom_https_configuration" "https" {
      + custom_https_provisioning_enabled = true
      + frontend_endpoint_id              = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoors/sdshmcts-dev/frontendEndpoints/dev-trib-tansport-appeals"
      + id                                = (known after apply)

      + custom_https_configuration {
          + certificate_source    = "FrontDoor"
          + minimum_tls_version   = (known after apply)
          + provisioning_state    = (known after apply)
          + provisioning_substate = (known after apply)
        }
    }

  # module.landing_zone.azurerm_frontdoor_custom_https_configuration.https["jd-bureau"] has moved to module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https["jd-bureau"]
    resource "azurerm_frontdoor_custom_https_configuration" "https" {
        id                                = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoors/sdshmcts-dev/customHttpsConfiguration/jd-bureau"
        # (2 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.landing_zone.azurerm_frontdoor_custom_https_configuration.https["jd-public"] has moved to module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https["jd-public"]
    resource "azurerm_frontdoor_custom_https_configuration" "https" {
        id                                = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoors/sdshmcts-dev/customHttpsConfiguration/jd-public"
        # (2 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.landing_zone.azurerm_frontdoor_custom_https_configuration.https["portal-dev"] has moved to module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https["portal-dev"]
    resource "azurerm_frontdoor_custom_https_configuration" "https" {
        id                                = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoors/sdshmcts-dev/customHttpsConfiguration/portal-dev"
        # (2 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.landing_zone.azurerm_frontdoor_custom_https_configuration.https["pre-portal"] has moved to module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https["pre-portal"]
    resource "azurerm_frontdoor_custom_https_configuration" "https" {
        id                                = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoors/sdshmcts-dev/customHttpsConfiguration/pre-portal"
        # (2 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.landing_zone.azurerm_frontdoor_custom_https_configuration.https["sds-api-mgmt"] has moved to module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https["sds-api-mgmt"]
    resource "azurerm_frontdoor_custom_https_configuration" "https" {
        id                                = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoors/sdshmcts-dev/customHttpsConfiguration/sds-api-mgmt"
        # (2 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.landing_zone.azurerm_frontdoor_custom_https_configuration.https["toffee"] has moved to module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https["toffee"]
    resource "azurerm_frontdoor_custom_https_configuration" "https" {
        id                                = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoors/sdshmcts-dev/customHttpsConfiguration/toffee"
        # (2 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.landing_zone.azurerm_frontdoor_custom_https_configuration.https["vh-admin-web"] has moved to module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https["vh-admin-web"]
    resource "azurerm_frontdoor_custom_https_configuration" "https" {
        id                                = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoors/sdshmcts-dev/customHttpsConfiguration/vh-admin-web"
        # (2 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.landing_zone.azurerm_frontdoor_custom_https_configuration.https["vh-test-web"] has moved to module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https["vh-test-web"]
    resource "azurerm_frontdoor_custom_https_configuration" "https" {
        id                                = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoors/sdshmcts-dev/customHttpsConfiguration/vh-test-web"
        # (2 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.landing_zone.azurerm_frontdoor_custom_https_configuration.https["vh-video-web"] has moved to module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https["vh-video-web"]
    resource "azurerm_frontdoor_custom_https_configuration" "https" {
        id                                = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoors/sdshmcts-dev/customHttpsConfiguration/vh-video-web"
        # (2 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.landing_zone.azurerm_frontdoor_custom_https_configuration.https["vh-video-web-pr-2057"] has moved to module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https["vh-video-web-pr-2057"]
    resource "azurerm_frontdoor_custom_https_configuration" "https" {
        id                                = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoors/sdshmcts-dev/customHttpsConfiguration/vh-video-web-pr-2057"
        # (2 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.landing_zone.azurerm_frontdoor_custom_https_configuration.https["vh-video-web-reform"] has moved to module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https["vh-video-web-reform"]
    resource "azurerm_frontdoor_custom_https_configuration" "https" {
        id                                = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoors/sdshmcts-dev/customHttpsConfiguration/vh-video-web-reform"
        # (2 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["darts-portal"] has moved to module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom["darts-portal"]
    resource "azurerm_frontdoor_firewall_policy" "custom" {
        id                                = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/dartsportaldev"
        name                              = "dartsportaldev"
        tags                              = {
            "application"  = "core"
            "builtFrom"    = "hmcts/sds-azure-platform"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "Low"
            "environment"  = "development"
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["dev-casetracker"] has moved to module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom["dev-casetracker"]
    resource "azurerm_frontdoor_firewall_policy" "custom" {
        id                                = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/devcasetrackerdev"
        name                              = "devcasetrackerdev"
        tags                              = {
            "application"  = "core"
            "builtFrom"    = "hmcts/sds-azure-platform"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "Low"
            "environment"  = "development"
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["dev-certificatedbailiffs"] has moved to module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom["dev-certificatedbailiffs"]
    resource "azurerm_frontdoor_firewall_policy" "custom" {
        id                                = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/devcertificatedbailiffsdev"
        name                              = "devcertificatedbailiffsdev"
        tags                              = {
            "application"  = "core"
            "builtFrom"    = "hmcts/sds-azure-platform"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "Low"
            "environment"  = "development"
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["dev-courtfines"] has moved to module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom["dev-courtfines"]
    resource "azurerm_frontdoor_firewall_policy" "custom" {
        id                                = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/devcourtfinesdev"
        name                              = "devcourtfinesdev"
        tags                              = {
            "application"  = "core"
            "builtFrom"    = "hmcts/sds-azure-platform"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "Low"
            "environment"  = "development"
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["dev-immigrationappealsonline"] has moved to module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom["dev-immigrationappealsonline"]
    resource "azurerm_frontdoor_firewall_policy" "custom" {
        id                                = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/devimmigrationappealsonlinedev"
        name                              = "devimmigrationappealsonlinedev"
        tags                              = {
            "application"  = "core"
            "builtFrom"    = "hmcts/sds-azure-platform"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "Low"
            "environment"  = "development"
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["dev-trib-admin-appeals"] has moved to module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom["dev-trib-admin-appeals"]
    resource "azurerm_frontdoor_firewall_policy" "custom" {
        id                                = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/devtribadminappealsdev"
        name                              = "devtribadminappealsdev"
        tags                              = {
            "application"  = "core"
            "builtFrom"    = "hmcts/sds-azure-platform"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "Low"
            "environment"  = "development"
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["dev-trib-care-standards"] has moved to module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom["dev-trib-care-standards"]
    resource "azurerm_frontdoor_firewall_policy" "custom" {
        id                                = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/devtribcarestandardsdev"
        name                              = "devtribcarestandardsdev"
        tags                              = {
            "application"  = "core"
            "builtFrom"    = "hmcts/sds-azure-platform"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "Low"
            "environment"  = "development"
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["dev-trib-cicap"] has moved to module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom["dev-trib-cicap"]
    resource "azurerm_frontdoor_firewall_policy" "custom" {
        id                                = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/devtribcicapdev"
        name                              = "devtribcicapdev"
        tags                              = {
            "application"  = "core"
            "builtFrom"    = "hmcts/sds-azure-platform"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "Low"
            "environment"  = "development"
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["dev-trib-employment-appeals"] has moved to module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom["dev-trib-employment-appeals"]
    resource "azurerm_frontdoor_firewall_policy" "custom" {
        id                                = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/devtribemploymentappealsdev"
        name                              = "devtribemploymentappealsdev"
        tags                              = {
            "application"  = "core"
            "builtFrom"    = "hmcts/sds-azure-platform"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "Low"
            "environment"  = "development"
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["dev-trib-finance-tax"] has moved to module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom["dev-trib-finance-tax"]
    resource "azurerm_frontdoor_firewall_policy" "custom" {
        id                                = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/devtribfinancetaxdev"
        name                              = "devtribfinancetaxdev"
        tags                              = {
            "application"  = "core"
            "builtFrom"    = "hmcts/sds-azure-platform"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "Low"
            "environment"  = "development"
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["dev-trib-immigration-svcs"] has moved to module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom["dev-trib-immigration-svcs"]
    resource "azurerm_frontdoor_firewall_policy" "custom" {
        id                                = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/devtribimmigrationsvcsdev"
        name                              = "devtribimmigrationsvcsdev"
        tags                              = {
            "application"  = "core"
            "builtFrom"    = "hmcts/sds-azure-platform"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "Low"
            "environment"  = "development"
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["dev-trib-info-rights"] has moved to module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom["dev-trib-info-rights"]
    resource "azurerm_frontdoor_firewall_policy" "custom" {
        id                                = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/devtribinforightsdev"
        name                              = "devtribinforightsdev"
        tags                              = {
            "application"  = "core"
            "builtFrom"    = "hmcts/sds-azure-platform"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "Low"
            "environment"  = "development"
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["dev-trib-land-reg-division"] has moved to module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom["dev-trib-land-reg-division"]
    resource "azurerm_frontdoor_firewall_policy" "custom" {
        id                                = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/devtriblandregdivisiondev"
        name                              = "devtriblandregdivisiondev"
        tags                              = {
            "application"  = "core"
            "builtFrom"    = "hmcts/sds-azure-platform"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "Low"
            "environment"  = "development"
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["dev-trib-lands-chamber"] has moved to module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom["dev-trib-lands-chamber"]
    resource "azurerm_frontdoor_firewall_policy" "custom" {
        id                                = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/devtriblandschamberdev"
        name                              = "devtriblandschamberdev"
        tags                              = {
            "application"  = "core"
            "builtFrom"    = "hmcts/sds-azure-platform"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "Low"
            "environment"  = "development"
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["dev-trib-tansport-appeals"] has moved to module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom["dev-trib-tansport-appeals"]
    resource "azurerm_frontdoor_firewall_policy" "custom" {
        id                                = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/devtribtansportappealsdev"
        name                              = "devtribtansportappealsdev"
        tags                              = {
            "application"  = "core"
            "builtFrom"    = "hmcts/sds-azure-platform"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "Low"
            "environment"  = "development"
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["jd-bureau"] has moved to module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom["jd-bureau"]
    resource "azurerm_frontdoor_firewall_policy" "custom" {
        id                                = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/jdbureaudev"
        name                              = "jdbureaudev"
        tags                              = {
            "application"  = "core"
            "builtFrom"    = "hmcts/sds-azure-platform"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "Low"
            "environment"  = "development"
        }
        # (6 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["jd-public"] has moved to module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom["jd-public"]
    resource "azurerm_frontdoor_firewall_policy" "custom" {
        id                                = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/jdpublicdev"
        name                              = "jdpublicdev"
        tags                              = {
            "application"  = "core"
            "builtFrom"    = "hmcts/sds-azure-platform"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "Low"
            "environment"  = "development"
        }
        # (6 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["portal-dev"] has moved to module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom["portal-dev"]
    resource "azurerm_frontdoor_firewall_policy" "custom" {
        id                                = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/portaldevdev"
        name                              = "portaldevdev"
        tags                              = {
            "application"  = "core"
            "builtFrom"    = "hmcts/sds-azure-platform"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "Low"
            "environment"  = "development"
        }
        # (6 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["pre-portal"] has moved to module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom["pre-portal"]
    resource "azurerm_frontdoor_firewall_policy" "custom" {
        id                                = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/preportaldev"
        name                              = "preportaldev"
        tags                              = {
            "application"  = "core"
            "builtFrom"    = "hmcts/sds-azure-platform"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "Low"
            "environment"  = "development"
        }
        # (6 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["sds-api-mgmt"] has moved to module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom["sds-api-mgmt"]
    resource "azurerm_frontdoor_firewall_policy" "custom" {
        id                                = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/sdsapimgmtdev"
        name                              = "sdsapimgmtdev"
        tags                              = {
            "application"  = "core"
            "builtFrom"    = "hmcts/sds-azure-platform"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "Low"
            "environment"  = "development"
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["toffee"] has moved to module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom["toffee"]
    resource "azurerm_frontdoor_firewall_policy" "custom" {
        id                                = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/toffeedev"
        name                              = "toffeedev"
        tags                              = {
            "application"  = "core"
            "builtFrom"    = "hmcts/sds-azure-platform"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "Low"
            "environment"  = "development"
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["vh-admin-web"] has moved to module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom["vh-admin-web"]
    resource "azurerm_frontdoor_firewall_policy" "custom" {
        id                                = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/vhadminwebdev"
        name                              = "vhadminwebdev"
        tags                              = {
            "application"  = "core"
            "builtFrom"    = "hmcts/sds-azure-platform"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "Low"
            "environment"  = "development"
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["vh-test-web"] has moved to module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom["vh-test-web"]
    resource "azurerm_frontdoor_firewall_policy" "custom" {
        id                                = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/vhtestwebdev"
        name                              = "vhtestwebdev"
        tags                              = {
            "application"  = "core"
            "builtFrom"    = "hmcts/sds-azure-platform"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "Low"
            "environment"  = "development"
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["vh-video-web"] has moved to module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom["vh-video-web"]
    resource "azurerm_frontdoor_firewall_policy" "custom" {
        id                                = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/vhvideowebdev"
        name                              = "vhvideowebdev"
        tags                              = {
            "application"  = "core"
            "builtFrom"    = "hmcts/sds-azure-platform"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "Low"
            "environment"  = "development"
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["vh-video-web-pr-2057"] has moved to module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom["vh-video-web-pr-2057"]
    resource "azurerm_frontdoor_firewall_policy" "custom" {
        id                                = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/vhvideowebpr2057dev"
        name                              = "vhvideowebpr2057dev"
        tags                              = {
            "application"  = "core"
            "builtFrom"    = "hmcts/sds-azure-platform"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "Low"
            "environment"  = "development"
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["vh-video-web-reform"] has moved to module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom["vh-video-web-reform"]
    resource "azurerm_frontdoor_firewall_policy" "custom" {
        id                                = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/vhvideowebreformdev"
        name                              = "vhvideowebreformdev"
        tags                              = {
            "application"  = "core"
            "builtFrom"    = "hmcts/sds-azure-platform"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "Low"
            "environment"  = "development"
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.landing_zone.azurerm_key_vault_access_policy.frontdoor_kv_access[0] has moved to module.landing_zone[0].azurerm_key_vault_access_policy.frontdoor_kv_access[0]
    resource "azurerm_key_vault_access_policy" "frontdoor_kv_access" {
        id                      = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/sds-platform-dev-rg/providers/Microsoft.KeyVault/vaults/acmedtssdsdev/objectId/0a7e9367-4349-4b24-974a-bfa7b23a38fc"
        # (7 unchanged attributes hidden)
    }

  # module.landing_zone[0].azurerm_monitor_diagnostic_setting.diagnostics_access_logs_sa[0] will be updated in-place
  # (moved from module.landing_zone.azurerm_monitor_diagnostic_setting.diagnostics_access_logs_sa[0])
  ~ resource "azurerm_monitor_diagnostic_setting" "diagnostics_access_logs_sa" {
        id                 = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoors/sdshmcts-dev|fd-log-analytics-logs-sa"
        name               = "fd-log-analytics-logs-sa"
        # (2 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.landing_zone.azurerm_monitor_diagnostic_setting.frontdoor_diagnostics has moved to module.landing_zone[0].azurerm_monitor_diagnostic_setting.frontdoor_diagnostics
    resource "azurerm_monitor_diagnostic_setting" "frontdoor_diagnostics" {
        id                         = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoors/sdshmcts-dev|fd-log-analytics"
        name                       = "fd-log-analytics"
        # (2 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.landing_zone.azurerm_role_assignment.frontdoor_kv_access[0] has moved to module.landing_zone[0].azurerm_role_assignment.frontdoor_kv_access[0]
    resource "azurerm_role_assignment" "frontdoor_kv_access" {
        id                   = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/sds-platform-dev-rg/providers/Microsoft.KeyVault/vaults/acmedtssdsdev/providers/Microsoft.Authorization/roleAssignments/9ccab797-f1b7-29e0-8675-e79b961c3368"
        name                 = "9ccab797-f1b7-29e0-8675-e79b961c3368"
        # (5 unchanged attributes hidden)
    }

Plan: 10 to add, 2 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":581,"Program":"tfcmt","SHA1":"","Target":"dev_frontdoor","Vars":{}} -->